ELPasEDT/src/Catalogs/События/События.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>События</name>
  <comment>(ПОГ и ЭЖ)</comment>
  <predefined>
    <items>
      <name>НачатьРаботы</name>
      <description>Начать работы (авария)</description>
    </items>
    <items>
      <name>ОбращениеВыполнено</name>
      <description>Обращение выполнено</description>
    </items>
    <items>
      <name>ОбращениеНеВыполнено</name>
      <description>Обращение не выполнено</description>
    </items>
    <items>
      <name>ОтданоРаспоряжение</name>
      <description>Отдано распоряжение</description>
    </items>
    <items>
      <name>ПолученоОбращение</name>
      <description>Получено обращение</description>
    </items>
    <items>
      <name>ПолученоРаспоряжение</name>
      <description>Получено распоряжение</description>
    </items>
    <items>
      <name>ПринятоОбращение</name>
      <description>Принято обращение</description>
    </items>
    <items>
      <name>ПринятоРаспоряжение</name>
      <description>Принято распоряжение</description>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
    </items>
    <items>
      <name>РаспоряжениеВыполнено</name>
      <description>Распоряжение выполнено</description>
    </items>
    <items>
      <name>РаспоряжениеНеВыполнено</name>
      <description>Распоряжение не выполнено</description>
    </items>
    <items>
      <name>СменуПринял</name>
      <description>Смену принял</description>
    </items>
    <items>
      <name>СменуСдал</name>
      <description>Смену сдал</description>
    </items>
    <items>
      <name>СформированоОбращение</name>
      <description>Сформировано обращение</description>
    </items>
  </predefined>
  <attributes>
    <name>ОповещениеНСС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеВЖурналеНСС</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокСокращенный</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаДляИзменения</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </attributes>
</mdclass:Catalog>

ELPasEDT/src/Enums/СтатусыЗаявокСокращенный/СтатусыЗаявокСокращенный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокСокращенный</name>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
</mdclass:Enum>

ELPasEDT/src/Catalogs/События/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.СобытиеВЖурналеНСС.Видимость = Объект.ОповещениеНСС;
	Элементы.ГруппаЗаявки.Видимость = ОтображатьГруппуЗаявок();
	Элементы.СсылкаДляИзменения.Видимость = ЗначениеЗаполнено(Объект.СсылкаДляИзменения) И ОтображатьГруппуЗаявок();
	Элементы.ФормаИзменить.Видимость = Не Объект.Ссылка.Пустая() И (Не ЗначениеЗаполнено(Объект.Статус) ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокСокращенный.Утверждена"));
	Элементы.СсылкаДляИзменения.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеНССПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();   	
	
КонецПроцедуры

&НаСервере
Функция ОтображатьГруппуЗаявок()
	
	Возврат Объект.Статус = Перечисления.СтатусыЗаявокСокращенный.НаРассмотрении;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ВИ++
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	//ВИ--
	
	//ВИ++
	//Заявки
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Статус = Перечисления.СтатусыЗаявокСокращенный.НаРассмотрении;
	КонецЕсли;
	//ВИ--
	
	Если Не ПравоДоступа("Изменение", Метаданные.Справочники.События) Тогда
		Элементы.ФормаИзменить.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.Статус.ТолькоПросмотр = Не ЗначениеЗаполнено(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	ЭтаФорма.Закрыть();
	
	Форма = ПолучитьФорму("Справочник.События.Форма.ФормаЭлемента");
	ЗаполнитьЗначенияСвойств(Форма.Объект,Объект,,"Код"); 
	Форма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокСокращенный.НаРассмотрении");
	Форма.Объект.СсылкаДляИзменения = Объект.Ссылка;
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)     	
		
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Статус) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаДляИзмененияПриИзменении(Элемент)
	
	ИзменениеСсылкиСервер();
	
КонецПроцедуры      

&НаСервере
Процедура ИзменениеСсылкиСервер()
	
	Объект.Наименование = Объект.СсылкаДляИзменения.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ОповещениеНСС И Не ЗначениеЗаполнено(Объект.СобытиеВЖурналеНСС) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнено значение события в журнале НСС ";
		Сообщение.Поле = "Объект.СобытиеВЖурналеНСС";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры
